{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_67", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_213_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_213", "trainable": true, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_199", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_214", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_200", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_68", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_132", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_133", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of46.bin", "group1-shard2of46.bin", "group1-shard3of46.bin", "group1-shard4of46.bin", "group1-shard5of46.bin", "group1-shard6of46.bin", "group1-shard7of46.bin", "group1-shard8of46.bin", "group1-shard9of46.bin", "group1-shard10of46.bin", "group1-shard11of46.bin", "group1-shard12of46.bin", "group1-shard13of46.bin", "group1-shard14of46.bin", "group1-shard15of46.bin", "group1-shard16of46.bin", "group1-shard17of46.bin", "group1-shard18of46.bin", "group1-shard19of46.bin", "group1-shard20of46.bin", "group1-shard21of46.bin", "group1-shard22of46.bin", "group1-shard23of46.bin", "group1-shard24of46.bin", "group1-shard25of46.bin", "group1-shard26of46.bin", "group1-shard27of46.bin", "group1-shard28of46.bin", "group1-shard29of46.bin", "group1-shard30of46.bin", "group1-shard31of46.bin", "group1-shard32of46.bin", "group1-shard33of46.bin", "group1-shard34of46.bin", "group1-shard35of46.bin", "group1-shard36of46.bin", "group1-shard37of46.bin", "group1-shard38of46.bin", "group1-shard39of46.bin", "group1-shard40of46.bin", "group1-shard41of46.bin", "group1-shard42of46.bin", "group1-shard43of46.bin", "group1-shard44of46.bin", "group1-shard45of46.bin", "group1-shard46of46.bin"], "weights": [{"name": "conv2d_213/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_213/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_214/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_214/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_132/kernel", "shape": [93312, 512], "dtype": "float32"}, {"name": "dense_132/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_133/kernel", "shape": [512, 3], "dtype": "float32"}, {"name": "dense_133/bias", "shape": [3], "dtype": "float32"}]}]}
